# BuiltInFailures.OverlapFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures Class
BuiltInFailures Class Members See Also
---
Failures detected by overlap check.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class OverlapFailures
```

Visual Basic
---
```text
Public NotInheritable Class OverlapFailures
```

Visual C++
---
```text
public ref class OverlapFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..OverlapFailures
# See Also
BuiltInFailures..::..OverlapFailures Members
Autodesk.Revit.DB Namespace